/* automatically generated by rust-bindgen 0.64.0 */

pub const VISION_OBJECT_ERR_SIG: u32 = 255;
pub const VISION_FOV_WIDTH: u32 = 316;
pub const VISION_FOV_HEIGHT: u32 = 212;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 37;

pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub type __u_char = ::core::ffi::c_uchar;
pub type __u_short = ::core::ffi::c_ushort;
pub type __u_int = ::core::ffi::c_uint;
pub type __u_long = ::core::ffi::c_ulong;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_long;
pub type __uint64_t = ::core::ffi::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::core::ffi::c_long;
pub type __u_quad_t = ::core::ffi::c_ulong;
pub type __intmax_t = ::core::ffi::c_long;
pub type __uintmax_t = ::core::ffi::c_ulong;
pub type __dev_t = ::core::ffi::c_ulong;
pub type __uid_t = ::core::ffi::c_uint;
pub type __gid_t = ::core::ffi::c_uint;
pub type __ino_t = ::core::ffi::c_ulong;
pub type __ino64_t = ::core::ffi::c_ulong;
pub type __mode_t = ::core::ffi::c_uint;
pub type __nlink_t = ::core::ffi::c_ulong;
pub type __off_t = ::core::ffi::c_long;
pub type __off64_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::core::ffi::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<__fsid_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::core::ffi::c_long;
pub type __rlim_t = ::core::ffi::c_ulong;
pub type __rlim64_t = ::core::ffi::c_ulong;
pub type __id_t = ::core::ffi::c_uint;
pub type __time_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_uint;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __suseconds64_t = ::core::ffi::c_long;
pub type __daddr_t = ::core::ffi::c_int;
pub type __key_t = ::core::ffi::c_int;
pub type __clockid_t = ::core::ffi::c_int;
pub type __timer_t = *mut ::core::ffi::c_void;
pub type __blksize_t = ::core::ffi::c_long;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blkcnt64_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = ::core::ffi::c_ulong;
pub type __fsblkcnt64_t = ::core::ffi::c_ulong;
pub type __fsfilcnt_t = ::core::ffi::c_ulong;
pub type __fsfilcnt64_t = ::core::ffi::c_ulong;
pub type __fsword_t = ::core::ffi::c_long;
pub type __ssize_t = ::core::ffi::c_long;
pub type __syscall_slong_t = ::core::ffi::c_long;
pub type __syscall_ulong_t = ::core::ffi::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::core::ffi::c_char;
pub type __intptr_t = ::core::ffi::c_long;
pub type __socklen_t = ::core::ffi::c_uint;
pub type __sig_atomic_t = ::core::ffi::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type int_fast16_t = ::core::ffi::c_long;
pub type int_fast32_t = ::core::ffi::c_long;
pub type int_fast64_t = ::core::ffi::c_long;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type uint_fast16_t = ::core::ffi::c_ulong;
pub type uint_fast32_t = ::core::ffi::c_ulong;
pub type uint_fast64_t = ::core::ffi::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub const vision_object_type_E_VISION_OBJECT_NORMAL: vision_object_type = 0;
pub const vision_object_type_E_VISION_OBJECT_COLOR_CODE: vision_object_type = 1;
pub const vision_object_type_E_VISION_OBJECT_LINE: vision_object_type = 2;
#[doc = " This enumeration defines the different types of objects\n that can be detected by the Vision Sensor"]
pub type vision_object_type = ::core::ffi::c_uint;
#[doc = " This enumeration defines the different types of objects\n that can be detected by the Vision Sensor"]
pub use self::vision_object_type as vision_object_type_e_t;
#[doc = " This structure contains the parameters used by the Vision Sensor\n to detect objects."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct vision_signature {
    pub id: u8,
    pub _pad: [u8; 3usize],
    pub range: f32,
    pub u_min: i32,
    pub u_max: i32,
    pub u_mean: i32,
    pub v_min: i32,
    pub v_max: i32,
    pub v_mean: i32,
    pub rgb: u32,
    pub type_: u32,
}
#[test]
fn bindgen_test_layout_vision_signature() {
    const UNINIT: ::core::mem::MaybeUninit<vision_signature> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<vision_signature>(),
        40usize,
        concat!("Size of: ", stringify!(vision_signature))
    );
    assert_eq!(
        ::core::mem::align_of::<vision_signature>(),
        1usize,
        concat!("Alignment of ", stringify!(vision_signature))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(_pad)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).u_min) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(u_min)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).u_max) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(u_max)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).u_mean) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(u_mean)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v_min) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(v_min)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v_max) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(v_max)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v_mean) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(v_mean)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rgb) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(rgb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_signature),
            "::",
            stringify!(type_)
        )
    );
}
#[doc = " This structure contains the parameters used by the Vision Sensor\n to detect objects."]
pub type vision_signature_s_t = vision_signature;
#[doc = " Color codes are just signatures with multiple IDs and a different type."]
pub type vision_color_code_t = u16;
#[doc = " This structure contains a descriptor of an object detected\n by the Vision Sensor"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct vision_object {
    pub signature: u16,
    pub type_: vision_object_type_e_t,
    pub left_coord: i16,
    pub top_coord: i16,
    pub width: i16,
    pub height: i16,
    pub angle: u16,
    pub x_middle_coord: i16,
    pub y_middle_coord: i16,
}
#[test]
fn bindgen_test_layout_vision_object() {
    const UNINIT: ::core::mem::MaybeUninit<vision_object> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<vision_object>(),
        20usize,
        concat!("Size of: ", stringify!(vision_object))
    );
    assert_eq!(
        ::core::mem::align_of::<vision_object>(),
        1usize,
        concat!("Alignment of ", stringify!(vision_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signature) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(signature)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).left_coord) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(left_coord)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).top_coord) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(top_coord)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).angle) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(angle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x_middle_coord) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(x_middle_coord)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).y_middle_coord) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(vision_object),
            "::",
            stringify!(y_middle_coord)
        )
    );
}
#[doc = " This structure contains a descriptor of an object detected\n by the Vision Sensor"]
pub type vision_object_s_t = vision_object;
pub const vision_zero_E_VISION_ZERO_TOPLEFT: vision_zero = 0;
pub const vision_zero_E_VISION_ZERO_CENTER: vision_zero = 1;
pub type vision_zero = ::core::ffi::c_uint;
pub use self::vision_zero as vision_zero_e_t;
extern "C" {
